# RepeatingDetailLayout Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RepeatingDetailLayout Property
ParameterTypeId Class See Also
---
"Layout"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RepeatingDetailLayout { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RepeatingDetailLayout As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RepeatingDetailLayout {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace